{
  "recipes": [
    {
      "name": "Classic Margherita Pizza",
      "description": "A classic Italian pizza with a thin crispy crust, rich tomato sauce, fresh mozzarella cheese, and fragrant basil.",
      "image": "margherita_pizza.jpg",
      "ingredients": [
        { "item": "Pizza dough", "quantity": "1 ball (about 250g)" },
        { "item": "Tomato sauce", "quantity": "1/2 cup" },
        { "item": "Fresh mozzarella cheese", "quantity": "200g, sliced" },
        { "item": "Fresh basil leaves", "quantity": "A handful" },
        { "item": "Olive oil", "quantity": "1 tbsp" },
        { "item": "Salt", "quantity": "To taste" },
        { "item": "Black pepper", "quantity": "To taste" }
      ],
      "instructions": [
        "Preheat your oven to 250°C (475°F). If you have a pizza stone, place it in the oven while it preheats.",
        "Roll out the pizza dough on a lightly floured surface to your desired thickness. If you prefer a thin crust, roll it out thinly.",
        "Transfer the dough to a baking sheet or a preheated pizza stone.",
        "Spread the tomato sauce evenly over the pizza dough, leaving a small border around the edges for the crust.",
        "Distribute the mozzarella slices evenly over the sauce.",
        "Drizzle olive oil over the pizza and sprinkle with a pinch of salt and black pepper.",
        "Bake the pizza in the preheated oven for 10-12 minutes, or until the crust is golden brown and the cheese has melted and is bubbling.",
        "Remove the pizza from the oven and top with fresh basil leaves.",
        "Cut the pizza into slices and serve immediately."
      ],
      "extra_notes": [
        "For a smoky flavor, consider adding a few drops of liquid smoke or grilling the pizza on a BBQ grill.",
        "You can also add a drizzle of balsamic glaze after baking for a sweet and tangy contrast."
      ]
    },
    {
      "name": "Spaghetti Carbonara",
      "description": "A traditional Roman pasta dish made with eggs, cheese, pancetta, and pepper, resulting in a creamy and comforting dish.",
      "image": "spaghetti_carbonara.jpg",
      "ingredients": [
        { "item": "Spaghetti", "quantity": "400g" },
        { "item": "Pancetta", "quantity": "150g, diced" },
        { "item": "Eggs", "quantity": "4 large" },
        { "item": "Pecorino Romano cheese", "quantity": "100g, finely grated" },
        { "item": "Parmesan cheese", "quantity": "50g, finely grated" },
        { "item": "Black pepper", "quantity": "Freshly cracked, to taste" },
        { "item": "Salt", "quantity": "To taste" },
        { "item": "Olive oil", "quantity": "For cooking" }
      ],
      "instructions": [
        "Bring a large pot of salted water to a boil. Cook the spaghetti according to the package instructions until al dente.",
        "While the pasta is cooking, heat a bit of olive oil in a large pan over medium heat. Add the pancetta and cook until crispy and golden.",
        "In a mixing bowl, whisk together the eggs, grated Pecorino Romano, Parmesan cheese, and a generous amount of freshly cracked black pepper. Set aside.",
        "Once the pasta is ready, reserve about a cup of pasta water, then drain the spaghetti.",
        "Add the hot pasta directly to the pan with the pancetta. Toss it in the rendered fat to coat the spaghetti.",
        "Remove the pan from the heat and quickly pour the egg and cheese mixture over the pasta. Toss well, adding reserved pasta water as needed to create a creamy sauce. The residual heat will cook the eggs, creating a silky texture.",
        "Serve the pasta immediately, garnished with extra Pecorino Romano and more cracked black pepper to taste."
      ],
      "extra_notes": [
        "For an extra touch, you can add a bit of garlic to the pancetta while frying it, but this is optional as the traditional recipe does not use garlic.",
        "Make sure to use the pasta water to adjust the creaminess of the sauce—it should be smooth and glossy, not too dry or runny."
      ]
    },
    {
      "name": "Pasi Paaruppu Payasam",
      "description": "Pasi Paruppu Payasam(Moong Dal Payasam),is a popular South Indian dessert enjoyed on special occasions and festivals. It’s made by lightly roasting yellow moong dal for a nutty aroma, then cooking it in creamy coconut milk and sweetening it with jaggery. Flavored with cardamom and topped with fried cashews and raisins, this payasam is rich, fragrant, and delicious.",
      "image": "chocolate_chip_cookies.jpg",
      "ingredients": [
        { "item": "Pasi Paruppu (Moong Dal)", "quantity": "250-300 gms" },
        { "item": "Javvarisi (Sago)", "quantity": "50 gms" },
        { "item": "Cashew Nut", "quantity": "handful" },
        { "item": "Raisins", "quantity": "handful" },
        { "item": "Elaichi powder", "quantity": "1-2spoon" },
        { "item": "Cut coconut pieces", "quantity": "Handful" },
        { "item": "Jaggery", "quantity": "300 gms" },
        { "item": "Coconut milk", "quantity": "1st and 2nd milk from one coconut" }
      ],
      "instructions": [
        "Dry roast the moong dal until aromatic",

"Dry roast the javvu arisi (sago) on very low heat, making sure the color does not change",

"Transfer both roasted moong dal and javvu arisi to a pressure cooker. Add water in a 1:3 ratio and cook for 3–4 whistles",

"In a frying pan, heat some ghee. Fry the cashews until they start to turn golden",

"Add the raisins; once they puff up, add the coconut pieces. Fry until the coconut turns light golden. Set this mixture aside",

"Once the cooker is opened, keep the flame low. Add jaggery to the cooked dal mixture and stir until it dissolves completely",

"Add the fried cashew–raisin–coconut mixture to the dal and mix well",

"Stir in cardamom powder (1–2 teaspoons, depending on your preference)",

"Add the second extract of coconut milk and let it cook for a few minutes",

"Add 1–2 teaspoons of ghee and continue cooking briefly",

"Finally, add the first extract of coconut milk, stir gently, and turn off the heat"
        
    ],
      "extra_notes": [
        "How to Extract First and Second Coconut Milk",

"Grate the coconut – Use fresh, mature coconut for best results.",

"First extract (thick milk) – Place the grated coconut in a blender with about ½ cup of warm water. Blend until fine, then strain through a muslin cloth or fine sieve, squeezing well to collect the thick, creamy milk. This is the first extract.",

"Second extract (thin milk) – Return the squeezed coconut pulp to the blender. Add another ½ cup of warm water, blend again, and strain. This lighter milk is the second extract.!",

"For frying coconut, they can be cut length wise or smaller bite sized pieces"
      ]
    },
    {
      "name": "Lemon Garlic Roast Chicken",
      "description": "Page Under Development",
      "image": "lemon_garlic_roast_chicken.jpg",
      "ingredients": [
        { "item": "Coming soon", "quantity": "TBD" }
      ],
      "instructions": [
        "Coming soon. Stay tuned!"
      ],
      "extra_notes": [
        "Stay tuned for more updates on this recipe!"
      ]
    },
    {
      "name": "Blueberry Muffins",
      "description": "Page Under Development",
      "image": "blueberry_muffins.jpg",
      "ingredients": [
        { "item": "Coming soon", "quantity": "TBD" }
      ],
      "instructions": [
        "Coming soon. Stay tuned!"
      ],
      "extra_notes": [
        "Stay tuned for more updates on this recipe!"
      ]
    },
    {
      "name": "Veggie Stir Fry",
      "description": "Page Under Development",
      "image": "veggie_stir_fry.jpg",
      "ingredients": [
        { "item": "Coming soon", "quantity": "TBD" }
      ],
      "instructions": [
        "Coming soon. Stay tuned!"
      ],
      "extra_notes": [
        "Stay tuned for more updates on this recipe!"
      ]
    },
    {
      "name": "Beef Tacos",
      "description": "Page Under Development",
      "image": "beef_tacos.jpg",
      "ingredients": [
        { "item": "Coming soon", "quantity": "TBD" }
      ],
      "instructions": [
        "Coming soon. Stay tuned!"
      ],
      "extra_notes": [
        "Stay tuned for more updates on this recipe!"
      ]
    },
    {
      "name": "Banana Pancakes",
      "description": "Page Under Development",
      "image": "banana_pancakes.jpg",
      "ingredients": [
        { "item": "Coming soon", "quantity": "TBD" }
      ],
      "instructions": [
        "Coming soon. Stay tuned!"
      ],
      "extra_notes": [
        "Stay tuned for more updates on this recipe!"
      ]
    }
  ]
}
